---
kind: type
id: T:Autodesk.Revit.DB.Visual.MasonryCMUType
source: html/29656caf-48a9-1642-14b7-7c7becd875ba.htm
---
# Autodesk.Revit.DB.Visual.MasonryCMUType

The enumerated type representing the permitted values for the asset property "MasonryCMUType" from the "MasonryCMU" schema.

## Syntax (C#)
```csharp
public enum MasonryCMUType
```